{"content": "# Incident Management Documentation - Network Team\n\n## ACCEPTING AN INCIDENT\n\nEnsure that the following fields are filled out accurately:\n• Configuration Item\n• CI Location (if CI is not available)\n• First access should be checked \n• Ensure that impact and urgency has been properly assessed (de-escalation should only be done with client/SDM consent)\n• Service Offering/Category and Sub-category should all be verified for accuracy\n• Update assigned to field with your name if not already completed\n\n## WORKING AN INCIDENT\n\n### What to provide in an update:\nAll ticket updates should be cogent and as concise as possible. Use complete sentences to detail your troubleshooting steps and provide evidence for your conclusions. Be polite and professional. Provide thorough explanations for command output and screenshots. Remember that we are a customer-facing team: good communication skills and professionalism are paramount. Poor documentation in a ticket reflects poorly on both engineers and our entire organization.\n\n• All client facing updates need to be proofread for grammar and accuracy\n• Engineer should acknowledge that they've taken ownership of a ticket with an update to the client. The acknowledgement should include a summary of the ticket as the engineer understands it and ask clarifying questions where details may be lacking – making sure that any information requested isn't already in the ticket, or accessible with the provided information\n• Acceptance of the incident should be sent via the Ticket Acceptance Template using the manual SNC email process – as the template is completed it needs to be copy/pasted into the Additional Comments of the incident for full customer visibility.\n• All future updates to the INC should follow the Ticket Update Template via the manual SNC email process.\n• Once the email has been formulated it is required to be copy and pasted into the Additional Comments field of the incident – this makes it visible via the portal and sends an additional notification to the user associated to the incident.\n• Additional correspondences with the client via phone or otherwise all need to be documented within the ticket following the above guidelines for clarity and conciseness. This includes an explanation of the issue, summary of what has transpired, and a screenshot of the evidence that is being referenced.\n• Any change in the 'current status' or 'next steps' will require an update to those fields to be documented in the ticket as well as a more detailed summary to be provided in the 'additional comments' for engineering\n• Event Date should accurately reflect the time for the next follow up\n• Command output and screenshots provided in client facing updates should be edited to only the relevant portions and should never be provided without explaining its relevancy\n• Any event dates set by the client should be marked in the ticket and the events that will occur on that date should be clearly communicated in a client facing update – using the Ticket Update Template manual email process and copy/paste into the Additional Comments.\n• Information requested from the client should be done so while clearly communicated specifically what we are asking for, and ONLY after validating that the information isn't already provided within the ticket already.\n• Once the ticket has been updated, and any progress made, the incident needs to have an update placed into the Work Notes (Private) field explaining the history of the incident (including what the issue is, what has been done and next steps). This is to assist in the event that the ticket has to be handed off and the next engineer doesn't have to review a long ticket thread to understand where exactly things are happening.\n• As you save the updates there is a pop-up requesting that you confirm the Time Worked on the incident. This field needs to be populated with how much time was spent on the current efforts, and not overall. The backend calculates all of the time spent. Ensuring this is done is paramount to correctly evaluating our costs per incident, cost per device type, and cost per client. There is no reason that a time shouldn't be entered, or that an inaccurate time is entered.\n\n## PROPER PENDING/PENDING REASONS\n\nThe correct usage of Pending Codes is paramount to communicating the correct state of the incident.\n• As each update provides the client an overall view of the incident, these are required to be accurate and updated every time a ticket is handled.\n• The Pending Reason should be utilized in the below scenarios:\n  - Client Action Required – Used when the incident is waiting on a response, involvement or action from the client.\n  - Client Hold – This should be used when monitoring the incident for any further repeats of the failure, or if the client requests that the incident be placed on hold.\n  - Future Enhancement – Used when the vendor is working to remediate the issue – potentially in a new release.\n  - RMA – Used when the device is needing to be replaced and is in the process of an RMA.\n  - Carrier – When a ticket is opened with the carrier (and appropriate ACT has been opened to track).\n  - Customer Maintenance – Used when the client is performing maintenance without the assistance of Presidio Managed Services.\n  - Internal Ticket – Only utilized when an internal RITM has been opened with the correct team to either adjust monitoring or validate why an issue was reported from our monitoring platform.\n  - Problem Management – Used when there is a corresponding Problem Ticket created within the ticketing system to identify, validate and remediate a reoccurring issue.\n  - Change Management – Used when a CHG has been submitted and the next action to perform is the change at the scheduled time.\n• The remaining Pending Reasons are infrequently used and should not be put into effect unless further stated.\n\n## WHEN AND WHAT TO COMMUNICATE IN A CLIENT FACING UPDATE\n\n### P1/P2\n• Upon taking ownership of an INC you should clearly communicate that you will be taking ownership of the INC\n• P1/2 Incidents should be worked with a client on the phone until resolution or a CHG window is set for resolution. Updates will be provided in the ticket as they occur\n• Unless in a client pending or pending - future enhancement state, updates should be provided hourly\n  – or –\n• Updates should be provided when any milestone is met or any positive/negative change in the condition of the Configuration Item/Impacted Service is detected.\n• P1/P2 tickets with an event date that has passed require an update within 24 hours and current status/next steps explaining why the ticket is waiting. The ticket event date should then be set accordingly, and appropriate pending status selected.\n\n### P3/P4\n• Upon taking ownership of an INC you should clearly communicate that you will be taking ownership of the INC.\n• Updates should be provided when any milestone is met or any positive/negative change in the condition of the Configuration Item/Impacted Service is detected.\n• Updates should be provided at least every 3 days for a P4 and every 2 days for a P3\n  -OR-\n• Updates should be provided on agreed upon event dates\n• Updates should be provided within 24 Hours of a P4 being customer updated or 12 hours of a P3 being customer updated\n\n### CHANGE COMMUNICATION – CREATION, ASSIGNED, IMPLEMENTED, COMPLETED\n• When a change is necessary to resolve a clients issue the Change Creation Template should be used via the SNC manual email process and pasted into the Additional Comments field within SNC. This includes the description, date, and who will be implementing the change. If the implementer is not currently known, remove the field from the thread.\n• When the change is moved into the Implement the implementing engineer is required to update the INC advising that the change has begun and is expected to run x amount of time. This response is not templatized.\n• When the change is completed the Change Completion/Testing Results template is to be used to communicate the results of the change. This also needs to be copied and pasted into the Additional Comments field within SNC as a public facing comment.\n\n## THINGS THAT SHOULD NEVER OCCUR:\n\n### Short lines for updates:\n- Things such as \"had a WebEx with the client\" or \"spoke with the client\".\n- These are not descriptive and only lead to confusion by both the client and any engineer who has to work on the issue after that conversation has happened.\n- The updates must follow the process outline in the previous section and should not deviate from that.\n\n### Incomplete Sentence/Improper Grammar\n- Proofreading is important and a requirement to ensure that we are delivering a consistent and quality messages to other engineers and to our clients.\n\n### Foul Language/Unprofessional Attitudes\n- Any cussing or unprofessional attitudes (things like belittling or speaking down to clients) is unacceptable and will not be tolerated.\n- Speak to our clients and to other engineers the exact same way that you would like to be spoken to.\n\n## RESOLVING AN INC:\n\n### Close Code should be selected and accurate. These should follow the selection process below:\n- Solved (Work Around): This option is selected when the client does not wish to pursue the incident/issue any further as there has been a fix put in place, but the underlying issue was not properly identified.\n- Solved (Permanently): Used when the issue was validated, identified, implemented and Root Cause provided to the client.\n- Not Solved (Not Reproducible): Used when the issue is a one-time occurrence that did not repeat itself and was not able to be reproduced to troubleshoot further.\n- Closed/Resolved by Caller: Used when the client resolves the issue themselves and does not require remediation from Presidio Managed Services.\n- Out of Scope: Used on the occasion that the client has requested something that does not fall in line with their Managed Services contract. This could be requesting network support for a voice only client, or requesting that a project be worked by MS instead of PS.\n\n### Cause Code should be accurate and reflect the true cause of the issue. These should follow the selection process below:\n- Cabling/Wiring: A cable/wire was replaced to resolve the issue.\n- Change Request: If the incident was requesting a change be made, and a CHG was submitted and performed to complete.\n- Hardware Failure: If an RMA was processed, or there was an actual issue with the hardware.\n- Information Request: Used when the client was specifically asking for information, such as user counts or a copy of their ACL entries.\n- Maintenance: Utilized for when/if the client is going to perform maintenance themselves without the aid of Presidio.\n- Misconfiguration: Used when there is a configuration change that had to be made to correct the underlying cause.\n- No Trouble Found/Unable to Reproduce: This should only be used when there is a reported issue that can't be reproduced or is performing as intended. THIS SHOULD NOT BE USED FREQUENTLY!\n- Over Utilization: If the device is working as designed, but is over utilized by either Memory, CPU, bandwidth or licensing.\n- Power: Only used if there was a power failure that lead the device being impacted.\n- Telco Circuit: Used when the service provider has an issue with the circuit at the location.\n- The remaining Cause Codes should not be used, unless explicitly instructed to do so.\n\n### Close Notes should reflect all steps taken during the INC that led to its resolution.\n- When the incident has been resolved to the best of the engineers' ability the Ticket Resolution Template should be utilized via the manual SNC email process. This should include a summary of the issue, what was done to resolve the issue, and a screenshot/confirmation that the incident is fully resolved.\n- The template is required to then be copied and pasted into the Resolution Notes field of the Incident.\n- Close notes should be as inclusive of all actions taken during the course of the incident as is necessary to explain how we came to the resolution\n", "timestamp": 1754170473.3120441, "source_hash": null}